ymaps.ready(init);

var myMap;

var mineral = [];
var pres = [];
var termal = [];
var termal_mineral = [];
var placemarks = [pres, mineral, termal,  termal_mineral];

function init() {
    myMap = new ymaps.Map("map", {
        center: [41.20, 74.00],
        zoom: 6,
        type: 'yandex#hybrid'
    });
    myMap.behaviors.enable('scrollZoom');
    myMap.controls.add('zoomControl', {
        float: 'none',
        position: {
            right: 40,
            top: 5
        }
    });

    var data = loadGeoData();
    for (var i=0; i < data.length; i++) {
        var row_data = data[i];

        var type = row_data[0];        
		var x = Number(row_data[10]);
		var y = Number(row_data[9]);
		var text = row_data[0];
        var size = Number(row_data[7]) * 10;
        
        var placemark = new ymaps.Placemark([x, y], {
			content: text,
			balloonContent: text + " тут!Э"
		}, {
            iconLayout: 'default#image',
            iconImageHref: getIcon(type),
            iconImageSize: [size, size],
            iconImageOffset: [-size/2, -size/2],
            visible: false
        });
        
        if (type == 'Бор') {
            pres.push(placemark);
        } else if (type == 'Барит') {
            mineral.push(placemark);
        } else if (type == 'Серный колчедан') {
            termal.push(placemark);
        } else if (type == 'Минеральные пигменты') {
            termal_mineral.push(placemark);
        }
    }

    putPlacemarksOnMap();

    var pres_button = new ymaps.control.Button('Бор');
    var mineral_button = new ymaps.control.Button('Барит');
    var termal_button = new ymaps.control.Button('Серный колчедан');
    var termal_mineral_button = new ymaps.control.Button('Минеральные пигменты');


    var typeControls = new ymaps.control.Group({
            items: [pres_button, mineral_button, termal_button,  termal_mineral_button]
        }, {
            position: { left: 40 }
    });

    pres_button.events.add(['select'], function (e) {
        showGroup(pres);
    });
    pres_button.events.add(['deselect'], function (e) {
        hideGroup(pres);
    });
    mineral_button.events.add(['select'], function (e) {
        showGroup(mineral);
    });
    mineral_button.events.add(['deselect'], function (e) {
        hideGroup(mineral);
    });
    termal_button.events.add(['select'], function (e) {
        showGroup(termal);
    });
    termal_button.events.add(['deselect'], function (e) {
        hideGroup(termal);
    });
    termal_mineral_button.events.add(['select'], function (e) {
        showGroup(termal_mineral);
    });
    termal_mineral_button.events.add(['deselect'], function (e) {
        hideGroup(termal_mineral);
    });


    myMap.controls.add(typeControls);
}


function showGroup(group) {
    myMap.setCenter([41.20, 74.00], 6, { duration: 1000 });
    for (var i = 0; i < group.length; i++) {
        group[i].options.set({ visible: true });
    }
}

function hideGroup(group) {
    for (var i = 0; i < group.length; i++) {
        group[i].options.set({ visible: false });
    }
}

function getIcon(type) {
        if (type == 'Бор') {
            return 'pure.png';
        } else if (type == 'Барит') {
            return 'mineral.png';
        } else if (type == 'Серный колчедан') {
            return 'thermal.png';
        } else if (type == 'Минеральные пигменты') {
            return 'thermalMineral.png';
        }
}

function putPlacemarksOnMap() {
    for (var i = 0; i < placemarks.length; i++) {
        for (var j = 0; j < placemarks[i].length; j++) {
            myMap.geoObjects.add(placemarks[i][j]);
        }        
    }
};



function loadGeoData() {
var data = [
["Бор","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","","","0","","72.42","42.7","13288265","4730862","","72.42","42.7","72.42","42.7","Таласский район","/icon/pure.png","1331__Terek.txt","","","","Таласская область","","42.68","Малоперспективное. <br>Высота 3550м, слабо освоенный район. <br>Поиски с поверхности  1953-57гг <br><br>Запасы не подсчитывались <br>Содержание турмалина достигает 50% массы. Кристаллы турмалина размером до 0.5х 0.1-0.25м  <br><br>В2О3 - 0.17-2.03% (0.64%) <br><br>Крутопадающие турмалиноносные пегматиты, жила гра-нодиоритов, гранит-порфиров (70-100мх0.5-2-15-25м)."],
["Бор","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","","Мелкое","3","","76.07","42.77","13587308","4737435","","76.07","42.77","76.07","42.77","Кеминский район","/icon/pure.png","1332__Balyksuiskoe.txt","","","","Чуйская область","","42.77","Перспективный объект. Выс. 1700-2000м, освоенный район. <br>Поиски с поверхности  1960-72гг  <br><br>Кат. Р1:  В2О3 - 1 млн.т <br><br>В2О3 - 3.54%  <br><br>Турмалиниты на контакте метаморфических сланцев PR1? и гранитов О3. Площадь турмалинитов - 0.4 км2."],
["Бор","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","","","0","","71.7","42.47","13228581","4708837","4","71.7","42.47","71.7","42.47","Таласский район","/icon/pure.png","1333__Cholok-Tashty.txt","","","","Таласская область","","42.47","Малоперспективно. Среднегорная зона, освоенный район. <br>Поиски с поверхности  1956-60гг <br><br>Запасы не подсчитывались <br>В2О3 - 0.68 - 1.31%  <br><br>Бороносные экзоскарны с вкрапленностью и линзами аксинита. Датолитоносная зона (25х2.5м) с содержанием датолита до 10-12%."],
["Бор","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","","","0","","71.73","42.41","13231109","4703176","","71.8","42.41","71.8","42.41","Бакай-Атинский район","/icon/pure.png","1334__Kumyshtagskoe.txt","","","","Таласская область","","42.42","Перспективный неизученный объект. Выс. 2200м. <br>Поиски с поверхности  1953-60гг <br><br>Кат. Р1: руда - 1 млн.м3 <br>Возможные ресурсы В2О3 не менее 54т.т/ <br><br>2% В2О3 - 1.95 - 3.25% <br><br>Бороносные экзоскарны по СЗ экзоконтакту гранитоидов S и метаморфических толщ PZ1. В скарнах - зоны турмалинизации (1.2-1.3кмх40-45м) с рудными линзами размером 200х75-100м."],
["Бор","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","","","0","","74.58","42.04","13465496","4655505","","74.6","42.04","74.6","42.04","Жумгальский район","/icon/pure.png","1335__Orto-Kugandy.txt","","","","Нарынская область","","42.03","Неизученный объект.  среднегорная зона, освоенный район. <br>Поиски с поверхности  1949-64гг Специализированное изучение САИГИМСом. <br><br>Запасы не подсчитывались <br>В2О3 - 0.5 - 4.5% Аксинитовые и датолитовые экзоскарны на контакте гранитов О3 с известняками R2."],
["Бор","Химическое сырье и соли","Неметаллические","Нерудные","Проявление","","","0","","71","41.62","13166578","4616878","","71","41.62","71","41.62","Ала-Букинский район","/icon/pure.png","1336__Vodorazdelnoe(I).txt","","","","Джалал-Абадская область","","41.62","Перспективный объект. Возможно наличие стратиформных горизонтов. <br>Детальные поиски  1957-61гг <br><br>Запасы не подсчитывались <br>В2О3 - 1.25- 4.0% <br><br>Минерализация в аксинит-амфиболитовых сланцах, насыщенных кристаллами аксинита размером 0.1-2см."],
["Барит","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","","Мелкое","3","","74.87","42.25","13488997","4679497","","74.87","42.25","74.87","42.25","Панфиловский район","/icon/Barite04-1.png","1324__Maitor.txt","","","","Чуйская область","","42.25","Не изученный на глубину объект. <br>Выс. 3600-3700м, слабо освоенный район. <br>Поисково-разведочные работы  1954г <br><br>BaSO4 :- <br>кат. C1 - 14.6тыс.т  <br>C2 - 21.6 тыс.т  <br>C1+C2 - 36.2 тыс.т  <br><br>BaSO4 - 41.8%<br><br>Крутопадающая баритовая жила (300х1.2-1.5м) в гранитоидах О3."],
["Барит","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","","Мелкое","3","","75.6","42.35","13549438","4690771","","75.6","42.35","75.6","42.35","Кочкорский район","/icon/Barite04-1.png","1325__Shooro.txt","","","","Нарынская область","","42.35","Малоперспективный объект. <br>Среднегорная зона, частично освоенный район. Поисково-разведочные работы на флангах месторождения Тюндукское  1958-60гг <br><br>Кат. C2 : BaSO4 - 12.9тыс.т  <br><br>BaSO4 - 57.08% <br>SiO2 - до 18% <br><br>Пологопадающая кварц-баритовая жила (180х0.5-2м) среди метаморфических сланцев О1-2."],
["Барит","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","240","Среднее","2","","75.6","42.33","13549451","4688919","","75.6","42.33","75.6","42.33","Кочкорский район","/icon/Barite04-1.png","1326__Tyundyukskoe.txt","","","","Нарынская область","","42.33","Разведанное месторождение, подготовленное к освоению. Выс. 2500м, освоенный район. <br>Поиски, разведка, доизучение 1958-60гг  <br>1994г (канавы). <br><br>Жилы №№ I - III кат.:  <br>С1 - BaSO4 - 41.8тыс.т  <br>С2 - BaSO4 - 49.4тыс.т  <br>Прожилковые руды  кат. С1+С2 -  BaSO4-24.9тыс.т <br>Всего -117.2тыс.т <br><br>BaSO4 - 75.56-94.43% <br>SiO2 - 1.37-16.8% <br>Fe2O3 0.49-6.5% <br>TiO2 - 0.04-0.34% <br>MnO - 0.1-0.63% <br>Al2O3 - 0.25-5.95% <br>CaO - 0.12-3.78%<br>MgO - 0.2-0.71%<br><br>3 крупные (60-180мх0.5-6.6м) и 25 мелких (7-46х0.2-4.5м) баритовых жил вдоль контакта песчано-алевролитовых толщ С1 и О. Барит соответствует ГОСТу 4682-84  класс Б."],
["Барит","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","239","Мелкое","3","","75.75","42.33","13561814","4689017","","75.75","42.33","75.75","42.33","Кочкорский район","/icon/Barite04-1.png","1327__Arsy.txt","","","","Нарынская область","","42.33","Барит-свинцовое разведанное месторождение. Учтено госбалансом. Выс. 2500м, освоенный район. <br>Поиски и разведка 1934 -55гг (канавы, штольни, бурение). <br><br>Учтенные балансом в контурах Pb руд - кат. С2: BaSO4-122.8тыс.т <br><br>На 13.09.1955г Pb:<br>кат. В - 10.4т.т/ 4.88% <br>С1 - 22.5т.т/ 3.7% <br>С2 - 3.9т.т/ 1.29% <br>Всего - 36.8т.т<br>Ag - 15.6т <br>Au - 0.899т <br>BaSO4 - 10.93% <br>Pb - 2.51%  <br>Ag - 13.9г/т Au - 0.8г/т <br><br>2 галенит-сфалерит-кварц-баритовые жилы (90х17.1м  450х3.4х300м)  среди карбонатно-терригенной толщи О1-2."],
["Барит","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","241","Среднее","2","","74.15","41.65","13429191","4613193","","74.15","41.65","74.15","41.65","Жумгальский район","/icon/Barite04-1.png","1328__Tabylgaty.txt","","","","Нарынская область","","41.65","Объект подготовлен для освоения открытым способом. <br>Выс. 2280м. <br>Поиски и разведка  1948-57гг (канавы, шурфы). <br><br>кат.С1 - BaSO4- 179.6тыс.т <br>кат.С2 - BaSO4- 214.6тыс.т <br>кат.С1+С2 - 394.2т.т,  в т.ч. Для краски <br><br>кат.А+В+С1 - 17.1тыс.т <br><br>BaSO4 - 71.97-91.2% <br>SiO2 - 0.98-10.46% <br>Fe2O3 - 0.33-4.49% <br>CaCO3 - 0.38-4.05% <br>ВаО - 29.18-61.02% <br><br>3 сорта руд Баритовая крутопадающая жила (330х1.5-7м) в красно-цветной песчано-алевролитовой толще D2-C1."],
["Барит","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","","Мелкое","3","","72.48","40.27","13285915","4462258","","72.48","40.27","72.48","40.27","Ноокатский район","/icon/Barite04-1.png","1329__Bel-Uruk.txt","","","","Ошская область","","40.27","Самостоятельных перспектив не имеет. <br>Объект для старательской отработки. <br>Выс. 1470м, освоенный район.<br>Поисковые и ревизионные работы на барит  1959г <br><br>кат. С1 -BaSO4-11.5тыс.т  <br>BaO - 51.57-60.25% <br>SiO2 - 3.8-12.9% <br>Fe2O3 - 0.15-0.3% <br>CaO - 0.53-2.9% <br>BaSO4- 78.38-91.57% <br><br>Уд. вес. 4.34 <br><br>Зона баритизации (78х2м) в кремнистых сланцах I,  насыщенная жилами и линзами барита (0.5-4мх0.1-0.7м)"],
["Барит","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","","","0","","72","40.03","13243918","4437623","","72","40.03","72","40.03","Ноокатский район","/icon/Barite04-1.png","1330__Karadjegach(#183).txt","","","","Ошская область","","40.03","Богатые руды. Выс. 1750м, хорошо освоенный район. <br>Общие поиски с поверхности  1973-76гг <br><br>кат. Р1 - BaSO4 - 28тыс.т  <br><br>BaSO4- 85.2-93.45% <br>SiO2 - 0.4-1.84%  <br>CaO - 0.02-0.3% <br>Fe2O3 - 0.6-1.6% <br>Плотность: 4.21-4.42г/см3  <br><br>9 баритовых тел (до 40х12м)  в сланцах S1-2. Опробовано 2 рудных тела мощностью 10 и 12м. Барит относится к I и II сортам."],
["Серный колчедан","Химическое сырье и соли","Неметаллические","Нерудные","Проявление","242","Крупное","1","","72.13","42.67","13264977","4729760","","72.13","42.67","72.13","42.67","Таласский район","/icon/Trepel-1.png","1337__Achic-Tash.txt","","","","Таласская область","","42.67","Месторождение,  подготовленное к освоению. Учитывается госбалансом. <br>Выс. 1500-2000м, освоенный район. <br>Предварительная и детальная разведки 1933,  1946,  1956гг <br><br>Госбаланс  млн.м3: 1.Серный колчедан: <br>кат. В - 1.617 <br>С1 - 5.860 <br>С2 - 3.365 <br>Забаланс.-5.805 <br>Всего - 16.647 2.<br><br>Сера: <br>кат.  В - 0.493 <br>С1 - 1.729 <br>С2 - 0.976 <br>Всего 3.198млн.м3 <br><br>S -10-43%  (ср. - 30%) <br><br>2 зоны пиритизации (2кмх 0.4км) в графитистых сланцах PR1?, содержащие 8 серноколчеданных залежей."],
["Серный колчедан","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","","Мелкое","3","","72.4","42.08","13284914","4666100","4","72.4","42.08","72.4","42.08","Токтогульский район","/icon/Trepel-1.png","1338__Kurgan.txt","","","","Джалал-Абадская область","","42.1","Самостоятельных перспектив не имеет. Среднегорная зона, частично освоенный район. Предварительная разведка  1939-40гг <br><br>Кат. С2:  S - 0.4млн.т <br><br>S -15%,  по р. т. № 10 - 30% <br><br>Рудная зона длиной 1300м в карбонатно-терригенных толщах R2-3. 12 рудных полисульфидных тел (6-135х6-70м)."],
["Серный колчедан","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","","","0","","73.67","42.33","13390108","4689606","","73.67","42.33","73.67","42.33","Панфиловский район","/icon/Trepel-1.png","1339__Tuyuktorskoe.txt","","","","Чуйская область","","42.33","Неизученный перспективный объект,  высокогорная зона (3300-3400м), слабо освоенный район.<br>Поиски с поверхности  1949г,  ревизия  1969-72гг Ресурсы пиритизированных руд - 5 млн.м3 на глубину 20м. <br><br>Нет сведений <br><br>3 зоны пиритизации (3-5кмх 1.5-60м) в зонах разрывов среди метаморфитов О."],
["Серный колчедан","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","","","0","","78.25","42.28","13768086","4688309","","78.25","42.28","78.25","42.28","Джети-Огузский район","/icon/Trepel-1.png","1340__Djetyoguzskoe.txt","","","","Иссык-Кульская область","","42.28","Бесперспективное.<br>Выс. 2300м, освоенный район. <br>Поиски и оценка с поверхности  1951-59гг <br><br>Запасы не подсчитывались <br><br>S - 15.58% <br>Cu - 0.03-0.3% <br><br>Рудное тело сливного колчедана (110х8м) в амфиболовых сланцах Є-О."],
["Минеральные пигменты","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","","Крупное","1","","74.23","42.62","13437097","4720504","","74.23","42.62","74.23","42.62","Сокулукский район","/icon/Trepel-1.png","1341__Belogorskoe.txt","","","","Чуйская область","","42.62","Перспективный объект. Разрабатывается местной промышленностью. Выс. 1480м. <br>Поиски  1957г <br><br>Кат. Р1 на 10м углубки - 1.65млн.т <br><br>Fe2O3 - 3.63-15.46% <br>MnO - 2.44-3.85%  <br><br>Часть глинистых сланцев удовлетв. требов. ГОСТа на неотмученную охру, часть - отвечает охре высшего качества.  Пигментные буровато-коричневые сланцы в составе красноцветной толщи С1 (15кмх 4.5км). Мощность горизонтов 1-5м."],
["Минеральные пигменты","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","","Крупное","1","","77.22","42.15","13683229","4670760","","77.2","42.15","77.2","42.15","Тонский район","/icon/Trepel-1.png","1342__Tossor.txt","","","","Иссык-Кульская область","","42.15","Естественное продолжение месторождения Согуты. Выс. 2000м. <br>Поисковые работы  1957г <br><br>Кат. Р1 - 1.986 млн.т <br>Отвечают требованиям на неотмученную охру и охру высшего качества. <br><br>Пигментные глины в виде линз и невыдержанных пластов образуют полосу дл. 1750м, шир. - 40-60м, мощность желтых глин - 34м,  розовых и красных - 15.2м"],
["Минеральные пигменты","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","","Крупное","1","","77.28","42.15","13688739","4670905","","77.28","42.15","77.28","42.15","Тонский район","/icon/Trepel-1.png","1343__Soguty.txt","","","","Иссык-Кульская область","","42.15","Перспективный изученный объект. Выс. 1800м, освоенный район. <br>Предварительная разведка  1957г <br><br>Кат. С1 - 1.19млн.т <br><br>Fe2O3 - 1.99-21.55%<br><br>Глины отвечают требованиям на неотмученную охру и частично охру высшего качества.<br>Пласты и линзы пигментных глин в угленосных толщах J. Протяженность линз до 110м, мощность 1-2м  суммарная мощность - 30м."],
["Минеральные пигменты","Химическое сырье и соли","Неметаллические","Нерудные","Проявление","","Крупное","1","","72.2","41.5","13266195","4599971","","72.2","41.5","72.2","41.5","Аксыйский район","/icon/Trepel-1.png","1344__Krasnaya Gorka.txt","","","","Джалал-Абадская область","","41.5","Перспективный объект. Выс. 1150м, освоенный район. <br>Общие поиски  1959г <br>Кат. Р1 -  3 млн.м3 (>7.5млн.т) <br><br>Потенциально пригодны для красок типа охра, мумии, сурик и др. Останец пигментных ярко-окрашенных глин К2 (300х 400м, мощность - 50м). Преобладают желтые глины."],
["Минеральные пигменты","Химическое сырье и соли","Неметаллические","Нерудные","Проявление","","Среднее","2","","73.22","40.95","13349840","4536633","4","73.26","40.95","73.26","40.95","Сузакский район","/icon/Trepel-1.png","1345__Ak-Changyl(Markayskoe).txt","","","","Джалал-Абадская область","","40.95","Перспективное месторождение. До 1936г разрабатывалось. Выс. 1450м. <br>Поисковые и ревизионные работы  1932-57гг<br><br>Кат. Р1 - 90тыс.т  <br><br>Fe2O3 -22.7-34.63% <br>MgO - 0.36-2.2% <br>CaO - до 2.41% <br><br>Краски имеют хорошую цветность, высокую дисперсность. Укрывистость - 35г/м2 <br><br>Горизонт железистых бокситов (300х1.1-1.3х150м) в угленосной толще J. По содержанию железа это краски типа мумии."],
["Минеральные пигменты","Химическое сырье и соли","Неметаллические","Нерудные","Проявление","","Крупное","1","","70.02","40.08","13074873","4450781","","70.02","40.08","70.02","40.08","Баткенский район","/icon/Trepel-1.png","1346__Belecenyk.txt","","","","Баткенская область","","40.08","Перспективный объект. Выс. 2000м, освоенный район. <br>Поиски и оценка  1972г <br><br>Кат. Р1 240тыс.т  <br><br>Fe2O3 - 11.52-63%  <br>водораствор. соли - 0.52-3.27%  <br><br>5 субвертикальных пластовых тел пигментов (200-400х3.7-17.3м) в известняках D3-C1. По содержанию Fe2O3 это природные мумии."],
["Минеральные пигменты","Химическое сырье и соли","Неметаллические","Нерудные","Проявление","","Крупное","1","","70.2","40.05","13090319","4446216","","70.2","40.05","70.2","40.05","Баткенский район","/icon/Trepel-1.png","1347__Madygenskoe.txt","","","","Баткенская область","","40.05","Перспективное. <br>Выс. 1200-1300м, хорошо освоенный район. <br>Поиски и оценка  1972г <br><br>Кат. Р1 -287тыс.т  <br><br>Fe2O3 - 7-14% <br>Маслоемкость - 29.3%. <br>Укрывистость - 106г/м2  <br><br>Сырье относится  к охрам марки Б. <br>3 горизонта глинистых пигментов в PZ толщах. Мощность горизонтов 10,  22,  2м, протяженность 900,  150,  750м. Глины желтые,  темно-красные,  красные."],
["Минеральные пигменты","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","","Крупное","1","","70.23","40.03","13093065","4444210","","70.23","40.03","70.23","40.03","Лейлекский район","/icon/Trepel-1.png","1348__Kurubel.txt","","","","Баткенская область","","40.03","Перспективный объект. Низкогорная зона, освоенный район. <br>Поисковые работы  1972г <br><br>Кат. Р1 -223тыс.т  <br><br>Fe2O3 - 12.3-49.35% <br>Водораствор. соли - 0.84-2.91% <br>Маслоемкость - 26-29% <br>Укрывистость - 79.8-111.75г/м2 <br><br>Среди PZ и J отложений линзообразные и пластообразные тела минеральных пигментов с окислами Fe. Параметры:80-650х5-12м."],
["Минеральные пигменты","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","","Крупное","1","","70.3","40.03","13098759","4443907","","70.3","40.03","70.3","40.03","Баткенский район","/icon/Trepel-1.png","1349__Chai-i-Kamar.txt","","","","Баткенская область","","40.03","Перспективный объект. Выс. 1600м, освоенный район. <br>Поиски  1972г <br><br>Кат. Р1 - умбры - 181тыс.т <br>охры - 270тыс.т <br><br>Всего -451тыс.т  <br><br>Fe2O3 - 11.48-58.24% <br><br>Пигменты пригодны для получения умбры коричневой и охры сухой. <br><br>4 крутопадающие тела пигментных лимонитов и ожелезненных известняков (75-400х12-25м) PZ."],
["Минеральные пигменты","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","","Крупное","1","","70.37","40.02","13104356","4441757","","70.37","40.02","70.37","40.02","Баткенский район","/icon/Trepel-1.png","1350__Sagul.txt","","","","Баткенская область","","40.02","Недостаточно изученный перспективный объект. Выс. 1600м, хорошо освоенный район. <br>Поиски  1972г <br><br>Кат. Р1 - 1.067млн.т<br><br>По качеству пигменты соответствуют: 1 - глинистым охрам, 2 - мумии светлой. Среди пород PZ и J 13 горизонтов минеральных пигментов."],
["Минеральные пигменты","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","","Мелкое","3","","70.53","40.02","13118593","4441029","","70.53","40.02","70.53","40.02","Баткенский район","/icon/Trepel-1.png","1351__Shurabskoe.txt","","","","Баткенская область","","40.02","Разведанное месторождение, готовое к отработке. <br>Низкогорная зона, хорошо освоенный район. <br>Разведочные работы  1952г <br><br>Кат. А+В+С1 - 42тыс.т <br><br>Fe2O3 - 8.58-33.16%<br><br>Юрские цветные глины в линзовидных залежах (240-600мх0.3-3.4м). Глины дисперсные красные, желтые, коричневые."],
["Минеральные пигменты","Химическое сырье и соли","Неметаллические","Нерудные","Коренное месторождение","","Крупное","1","","72.7","40.32","13304492","4467310","","72.7","40.32","72.7","40.32","Ноокатский район","/icon/Trepel-1.png","1352__Yatanskoe.txt","","","","Ошская область","","40.32","Перспективные,  объект с богатой гаммой красных пегматитов.<br>Низкогорная зона, хорошо освоенный район. <br>Поисково-оценочные работы 1946,  1961г <br><br>Кат. С2: 260тыс.м3 (>650т.т) <br><br>Fe2O3 - 4.89-13.92%, макс. - 22.86%. <br><br>Глины дисперсные, пластичные,  пригодные для приготовления охры и мумии. <br>Среди отложений керамических глин, приуроченных к угленосным толщам J,  залегают залежи пигментных глин. Мощность залежей 0.85-1.65м, протяженность значительная."]

];
	return data;	
}
